benchmark-results/round-3-intel/smade - 1 - 2.txt
32        Threads
6         Connections per thread
500000    Requests per client


ALL STATS
============================================================================================================================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p80 Latency     p90 Latency     p99 Latency   p99.9 Latency p99.990 Latency p99.995 Latency p99.999 Latency    p100 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
Sets      1333433.34          ---          ---         1.14750         1.11900         1.27100         1.39900         1.77500         2.00700         2.38300         2.52700         2.79900         6.17500     88403.78 
Gets            0.00         0.00         0.00             ---             ---             ---             ---             ---             ---             ---             ---             ---             ---         0.00 
Waits           0.00          ---          ---             ---             ---             ---             ---             ---             ---             ---             ---             ---             ---          --- 
Totals    1333433.34         0.00         0.00         1.14750         1.11900         1.27100         1.39900         1.77500         2.00700         2.38300         2.52700         2.79900         6.17500     88403.78 
32        Threads
6         Connections per thread
500000    Requests per client


ALL STATS
============================================================================================================================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p80 Latency     p90 Latency     p99 Latency   p99.9 Latency p99.990 Latency p99.995 Latency p99.999 Latency    p100 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
Sets       133779.03          ---          ---         1.04192         1.01500         1.16700         1.28700         1.56700         1.74300         1.91100         1.99100         2.35100         8.76700      8882.95 
Gets      1337775.55      7301.85   1330473.69         1.04193         1.01500         1.16700         1.28700         1.56700         1.74300         1.91100         1.99900         2.33500         8.76700     53710.62 
Waits           0.00          ---          ---             ---             ---             ---             ---             ---             ---             ---             ---             ---             ---          --- 
Totals    1471554.57      7301.85   1330473.69         1.04193         1.01500         1.16700         1.28700         1.56700         1.74300         1.91100         1.99900         2.33500         8.76700     62593.57 
32        Threads
6         Connections per thread
75000     Requests per client


ALL STATS
============================================================================================================================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p80 Latency     p90 Latency     p99 Latency   p99.9 Latency p99.990 Latency p99.995 Latency p99.999 Latency    p100 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
Sets        22279.27          ---          ---         0.78313         0.77500         0.87900         0.94300         1.14300         1.27900         1.42300         1.53500         1.85500         3.85500      1479.32 
Gets       222763.33      1313.43    221449.90         0.78303         0.77500         0.87900         0.94300         1.14300         1.27900         1.40700         1.47900         1.66300         2.23900      8945.80 
Waits           0.00          ---          ---             ---             ---             ---             ---             ---             ---             ---             ---             ---             ---          --- 
Totals     245042.61      1313.43    221449.90         0.78304         0.77500         0.87900         0.94300         1.14300         1.27900         1.40700         1.47900         1.68700         3.85500     10425.12 
32        Threads
6         Connections per thread
500000    Requests per client


ALL STATS
============================================================================================================================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p80 Latency     p90 Latency     p99 Latency   p99.9 Latency p99.990 Latency p99.995 Latency p99.999 Latency    p100 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
Sets       123803.26          ---          ---         1.12620         1.09500         1.25500         1.39900         1.71900         1.88700         2.07900         2.19100         2.62300         3.55100      8207.91 
Gets      1238018.98   1238018.98         0.00         1.12608         1.09500         1.25500         1.39900         1.71900         1.88700         2.07900         2.19100         2.60700         3.55100     76032.98 
Waits           0.00          ---          ---             ---             ---             ---             ---             ---             ---             ---             ---             ---             ---          --- 
Totals    1361822.24   1238018.98         0.00         1.12609         1.09500         1.25500         1.39900         1.71900         1.88700         2.07900         2.19100         2.60700         3.55100     84240.89 
32        Threads
6         Connections per thread
75000     Requests per client


ALL STATS
============================================================================================================================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p80 Latency     p90 Latency     p99 Latency   p99.9 Latency p99.990 Latency p99.995 Latency p99.999 Latency    p100 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
Sets        21962.10          ---          ---         0.79425         0.79100         0.89500         0.95900         1.15100         1.29500         1.47100         1.55900         1.83100         2.30300      1455.98 
Gets       219592.00    219592.00         0.00         0.79425         0.79100         0.89500         0.95900         1.15100         1.29500         1.44700         1.52700         1.72700         2.30300     13486.15 
Waits           0.00          ---          ---             ---             ---             ---             ---             ---             ---             ---             ---             ---             ---          --- 
Totals     241554.09    219592.00         0.00         0.79425         0.79100         0.89500         0.95900         1.15100         1.29500         1.44700         1.52700         1.72700         2.30300     14942.13